import pytest
import json

DATA_FROM_XLCX = [
    {'Дата операции': '31.12.2021 16:44:00', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
     'Сумма операции': -160.89, 'Валюта операции': 'RUB', 'Сумма платежа': -160.89, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 3,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 160.89},
    {'Дата операции': '31.12.2021 16:42:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
     'Сумма операции': -64.0, 'Валюта операции': 'RUB', 'Сумма платежа': -64.0, 'Валюта платежа': 'RUB', 'Кэшбэк': None,
     'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 1,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 64.0},
    {'Дата операции': '31.12.2021 16:39:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
     'Сумма операции': -118.12, 'Валюта операции': 'RUB', 'Сумма платежа': -118.12, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Магнит', 'Бонусы (включая кэшбэк)': 2,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 118.12},
    {'Дата операции': '31.12.2021 15:44:39', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
     'Сумма операции': -78.05, 'Валюта операции': 'RUB', 'Сумма платежа': -78.05, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 1,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 78.05},
    {'Дата операции': '31.12.2021 01:23:42', 'Дата платежа': '31.12.2021', 'Номер карты': '*5091', 'Статус': 'OK',
     'Сумма операции': -564.0, 'Валюта операции': 'RUB', 'Сумма платежа': -564.0, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Различные товары', 'MCC': 5399.0, 'Описание': 'Ozon.ru',
     'Бонусы (включая кэшбэк)': 5, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 564.0},
    {'Дата операции': '31.12.2021 00:12:53', 'Дата платежа': '31.12.2021', 'Номер карты': None, 'Статус': 'OK',
     'Сумма операции': -800.0, 'Валюта операции': 'RUB', 'Сумма платежа': -800.0, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Переводы', 'MCC': None, 'Описание': 'Константин Л.', 'Бонусы (включая кэшбэк)': 0,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 800.0},
    {'Дата операции': '30.12.2021 22:22:03', 'Дата платежа': '31.12.2021', 'Номер карты': None, 'Статус': 'OK',
     'Сумма операции': -20000.0, 'Валюта операции': 'RUB', 'Сумма платежа': -20000.0, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Переводы', 'MCC': None, 'Описание': 'Константин Л.', 'Бонусы (включая кэшбэк)': 0,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 20000.0},
    {'Дата операции': '30.12.2021 19:18:22', 'Дата платежа': '31.12.2021', 'Номер карты': '*5091', 'Статус': 'OK',
     'Сумма операции': -7.07, 'Валюта операции': 'RUB', 'Сумма платежа': -7.07, 'Валюта платежа': 'RUB', 'Кэшбэк': None,
     'Категория': 'Каршеринг', 'MCC': 7512.0, 'Описание': 'Ситидрайв', 'Бонусы (включая кэшбэк)': 0,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 7.07}]

home_page_data = {
    "greeting": "Добрый день",
    "cards": [
        {
            "last_digits": "5814",
            "total_spent": 1262.00,
            "cashback": 12.62
        },
        {
            "last_digits": "7512",
            "total_spent": 7.94,
            "cashback": 0.08
        }
    ],
    "top_transactions": [
        {
            "date": "21.12.2021",
            "amount": 1198.23,
            "category": "Переводы",
            "description": "Перевод Кредитная карта. ТП 10.2 RUR"
        },
        {
            "date": "20.12.2021",
            "amount": 829.00,
            "category": "Супермаркеты",
            "description": "Лента"
        },
        {
            "date": "20.12.2021",
            "amount": 421.00,
            "category": "Различные товары",
            "description": "Ozon.ru"
        },
        {
            "date": "16.12.2021",
            "amount": -14216.42,
            "category": "ЖКХ",
            "description": "ЖКУ Квартира"
        },
        {
            "date": "16.12.2021",
            "amount": 453.00,
            "category": "Бонусы",
            "description": "Кешбэк за обычные покупки"
        }
    ],
    "currency_rates": [
        {
            "currency": "USD",
            "rate": 73.21
        },
        {
            "currency": "EUR",
            "rate": 87.08
        }
    ],
    "stock_prices": [
        {
            "stock": "AAPL",
            "price": 150.12
        },
        {
            "stock": "AMZN",
            "price": 3173.18
        },
        {
            "stock": "GOOGL",
            "price": 2742.39
        },
        {
            "stock": "MSFT",
            "price": 296.71
        },
        {
            "stock": "TSLA",
            "price": 1007.08
        }
    ]
}


@pytest.fixture
def data_home_page() -> json:
    return json.dumps(home_page_data, indent=4)


@pytest.fixture
def expected_xlcx() -> list:
    return DATA_FROM_XLCX


@pytest.fixture
def expected_cards() -> list:
    return [
    {
        'last_digits': '*7197',
        'total_spent': 421.06,
        'cashback': 0
    },
    {
        'last_digits': '*5091',
        'total_spent': 571.07,
        'cashback': 0
    }
]
