import pytest
import json

expected_stocks = [
    {
        "stock": "AAPL",
        "price": 201.69
    },
    {
        "stock": "AMZN",
        "price": 209.77
    },
    {
        "stock": "GOOGL",
        "price": 165.66
    },
    {
        "stock": "MSFT",
        "price": 475.93
    },
    {
        "stock": "TSLA",
        "price": 343.68
    }
]

expected_top = [
    {'date': '31.12.2021', 'amount': -20000.0, 'category': 'Переводы', 'description': 'Константин Л.'},
    {'date': '31.12.2021', 'amount': -800.0, 'category': 'Переводы', 'description': 'Константин Л.'},
    {'date': '31.12.2021', 'amount': -564.0, 'category': 'Различные товары', 'description': 'Ozon.ru'},
    {'date': '31.12.2021', 'amount': -160.89, 'category': 'Супермаркеты', 'description': 'Колхоз'},
    {'date': '31.12.2021', 'amount': -118.12, 'category': 'Супермаркеты', 'description': 'Магнит'}
]

DATA_FROM_XLCX = [
    {'Дата операции': '31.12.2021 16:44:00', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
     'Сумма операции': -160.89, 'Валюта операции': 'RUB', 'Сумма платежа': -160.89, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 3,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 160.89},
    {'Дата операции': '31.12.2021 16:42:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
     'Сумма операции': -64.0, 'Валюта операции': 'RUB', 'Сумма платежа': -64.0, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 1,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 64.0},
    {'Дата операции': '31.12.2021 16:39:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
     'Сумма операции': -118.12, 'Валюта операции': 'RUB', 'Сумма платежа': -118.12, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Магнит', 'Бонусы (включая кэшбэк)': 2,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 118.12},
    {'Дата операции': '31.12.2021 15:44:39', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
     'Сумма операции': -78.05, 'Валюта операции': 'RUB', 'Сумма платежа': -78.05, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 1,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 78.05},
    {'Дата операции': '31.12.2021 01:23:42', 'Дата платежа': '31.12.2021', 'Номер карты': '*5091', 'Статус': 'OK',
     'Сумма операции': -564.0, 'Валюта операции': 'RUB', 'Сумма платежа': -564.0, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Различные товары', 'MCC': 5399.0, 'Описание': 'Ozon.ru',
     'Бонусы (включая кэшбэк)': 5, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 564.0},
    {'Дата операции': '31.12.2021 00:12:53', 'Дата платежа': '31.12.2021', 'Номер карты': None, 'Статус': 'OK',
     'Сумма операции': -800.0, 'Валюта операции': 'RUB', 'Сумма платежа': -800.0, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Переводы', 'MCC': None, 'Описание': 'Константин Л.', 'Бонусы (включая кэшбэк)': 0,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 800.0},
    {'Дата операции': '30.12.2021 22:22:03', 'Дата платежа': '31.12.2021', 'Номер карты': None, 'Статус': 'OK',
     'Сумма операции': -20000.0, 'Валюта операции': 'RUB', 'Сумма платежа': -20000.0, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Переводы', 'MCC': None, 'Описание': 'Константин Л.', 'Бонусы (включая кэшбэк)': 0,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 20000.0},
    {'Дата операции': '30.12.2021 19:18:22', 'Дата платежа': '31.12.2021', 'Номер карты': '*5091', 'Статус': 'OK',
     'Сумма операции': -7.07, 'Валюта операции': 'RUB', 'Сумма платежа': -7.07, 'Валюта платежа': 'RUB',
     'Кэшбэк': None, 'Категория': 'Каршеринг', 'MCC': 7512.0, 'Описание': 'Ситидрайв', 'Бонусы (включая кэшбэк)': 0,
     'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 7.07}]

home_page_data = {
    "greeting": "Добрый вечер",
    "cards": [
        {
            "last_digits": "*5091",
            "total_spent": 571.07,
            "cashback": 0
        },
        {
            "last_digits": "*7197",
            "total_spent": 421.06,
            "cashback": 0
        }
    ],
    "top_transactions": [
        {
            "date": "31.12.2021",
            "amount": -20000.0,
            "category": "Переводы",
            "description": "Константин Л."
        },
        {
            "date": "31.12.2021",
            "amount": -800.0,
            "category": "Переводы",
            "description": "Константин Л."
        },
        {
            "date": "31.12.2021",
            "amount": -564.0,
            "category": "Различные товары",
            "description": "Ozon.ru"
        },
        {
            "date": "31.12.2021",
            "amount": -160.89,
            "category": "Супермаркеты",
            "description": "Колхоз"
        },
        {
            "date": "31.12.2021",
            "amount": -118.12,
            "category": "Супермаркеты",
            "description": "Магнит"
        }
    ],
    "currency_rates": [
        {
            "currency": "USD",
            "rate": 78.2
        },
        {
            "currency": "EUR",
            "rate": 91.06
        }
    ],
    "stock_prices": [
        {
            "stock": "AAPL",
            "price": 201.96
        },
        {
            "stock": "AMZN",
            "price": 213.16
        },
        {
            "stock": "GOOGL",
            "price": 171.88
        },
        {
            "stock": "MSFT",
            "price": 491.85
        },
        {
            "stock": "TSLA",
            "price": 326.63
        }
    ]
}


@pytest.fixture
def data_home_page() -> str:
    return json.dumps(home_page_data, indent=4, ensure_ascii=False)


@pytest.fixture
def expected_xlcx() -> list:
    return DATA_FROM_XLCX


@pytest.fixture
def expected_cards() -> list:
    return [
        {
            'last_digits': '*7197',
            'total_spent': 421.06,
            'cashback': 0
        },
        {
            'last_digits': '*5091',
            'total_spent': 571.07,
            'cashback': 0
        }
    ]
